#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-3QEFR1KLobEjGWdx

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role_policy_attachment.crawler_policy_attach2: Refreshing state... [id=crawler_role-20220613072735631000000001]
aws_iam_role_policy_attachment.crawler_policy_attach1: Refreshing state... [id=crawler_role-20220613072735631200000002]
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_apigatewayv2_api.lambda: Refreshing state... [id=sdwwn04i87]
aws_lambda_layer_version.boto3-layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3-layer:1]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220613060156176300000001]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=mwf2urb]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=jjdogw5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.sqs_publish_policy will be created
  + resource "aws_iam_policy" "sqs_publish_policy" {
      + arn         = (known after apply)
      + description = "Grants permission to publish to the crawled-urls SQS queue"
      + id          = (known after apply)
      + name        = "sqs_publish_policy"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.scanner_role will be created
  + resource "aws_iam_role" "scanner_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "scanner_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach1 will be destroyed
  # (because aws_iam_role_policy_attachment.crawler_policy_attach1 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "crawler_policy_attach1" {
      - id         = "crawler_role-20220613072735631200000002" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole" -> null
      - role       = "crawler_role" -> null
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach2 will be destroyed
  # (because aws_iam_role_policy_attachment.crawler_policy_attach2 is not in configuration)
  - resource "aws_iam_role_policy_attachment" "crawler_policy_attach2" {
      - id         = "crawler_role-20220613072735631000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "crawler_role" -> null
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "crawler_policy_attach_lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "crawler_role"
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach_readonly will be created
  + resource "aws_iam_role_policy_attachment" "crawler_policy_attach_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "crawler_role"
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish will be created
  + resource "aws_iam_role_policy_attachment" "crawler_policy_attach_sqs_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "crawler_role"
    }

  # aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic will be created
  + resource "aws_iam_role_policy_attachment" "scanner_policy_attach_lambda_basic" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "scanner_role"
    }

  # aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution will be created
  + resource "aws_iam_role_policy_attachment" "scanner_policy_attach_sqs_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaSQSQueueExecutionRole"
      + role       = "scanner_role"
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-14T06:41:09.000+0000" -> (known after apply)
      ~ source_code_hash               = "DB4tjh6C6hy8Joubnu5aKiXmByEI4hEu+Z78urFRlzc=" -> "+u0TrH6T78RBXUwod2nrHdTV0Q/tCsFWE0lw2JCjHRg="
        tags                           = {}
        # (18 unchanged attributes hidden)

      + environment {
          + variables = (known after apply)
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-14T06:18:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "o3uAU9cS06uFI9EmFhmFLS/OvSNpZQ4/XntyTaKnsgc=" -> "wBvB1I2YtvXjnsc+nAJ//fEbmZFGPUmZtyhb2TLE2zA="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_sqs_queue.crawled-urls will be created
  + resource "aws_sqs_queue" "crawled-urls" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 7200
      + name                              = "crawled-urls"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 8 to add, 2 to change, 2 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*